99cats/ninetyninecats/app/controllers/cats_controller.rb

  def create

    @cat = Cat.new(cats_params)

    if @cat.save
---
INSERT INTO "cats" ("birthdate", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)